Билет5/src/Documents/РасходнаяНакладная/РасходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходнаяНакладная</name>
  <registerRecords>AccumulationRegister.ОстаткиНоменклатуры</registerRecords>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПоДокументу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Билет5/src/Documents/РасходнаяНакладная/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийСписокНоменклатуры

&НаКлиенте
Процедура СписокНоменклатурыНоменклатураПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиент.ПриИзменении(ЭтотОбъект, Элемент, Истина, Ложь, ДанныеДляЗаполнения);
	
	Если ДанныеДляЗаполнения <> Неопределено Тогда
		ИзменитьТекущиеДанные(ДанныеДляЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура ИзменитьТекущиеДанные(ДанныеДляЗаполнения)
	
	Объект.СписокНоменклатуры[ДанныеДляЗаполнения.НомерСтроки-1].Цена = ДанныеДляЗаполнения.Цена;
	Объект.СписокНоменклатуры[ДанныеДляЗаполнения.НомерСтроки-1].Сумма = ДанныеДляЗаполнения.Цена * Объект.СписокНоменклатуры[ДанныеДляЗаполнения.НомерСтроки-1].Количество;
	Объект.СписокНоменклатуры[ДанныеДляЗаполнения.НомерСтроки-1].Склад = Объект.Склад;
	
КонецПроцедуры

&НаСервере
Процедура СписокНоменклатурыКоличествоПриИзмененииНаСервере(НомерСтроки, Количество, Цена)
	
	Объект.СписокНоменклатуры[НомерСтроки-1].Сумма = Цена * Количество;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = ЭтотОбъект.ТекущийЭлемент.ТекущиеДанные;
	СписокНоменклатурыКоличествоПриИзмененииНаСервере(ТекущиеДанные.НомерСтроки, ТекущиеДанные.Количество, ТекущиеДанные.Цена);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Для Каждого Стр Из ТекущийОбъект.СписокНоменклатуры Цикл
		Стр.Склад = ТекущийОбъект.Склад;
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти
